esp8266/Arduino/libraries/ESP8266mDNS/LEA_mDNSResponder/ESP8266mDNS Control.cpp
/*
 * ESP8266mDNS Control.cpp
 *
 *  License (MIT license):
 *    Permission is hereby granted, free of charge, to any person obtaining a copy
 *    of this software and associated documentation files (the "Software"), to deal
 *    in the Software without restriction, including without limitation the rights
 *    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *    copies of the Software, and to permit persons to whom the Software is
 *    furnished to do so, subject to the following conditions:
 *
 *    The above copyright notice and this permission notice shall be included in
 *    all copies or substantial portions of the Software.
 *
 *    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 *    THE SOFTWARE.
 *
 */

#include <arch/cc.h>
#include <HardwareSerial.h>
#include <IPAddress.h>
#include <lwip/ip_addr.h>
#include <WString.h>
#include <cstdint>

#include "ESP8266mDNS.h"

/*
 * ESP8266mDNS Control.cpp
 */

extern "C" {
    #include "user_interface.h"
}

#include "lwip/prot/dns.h"  // DNS_RRTYPE_xxx, DNS_MQUERY_PORT

#include "ESP8266mDNS Priv.h"


/*
 * namespace LEA_MDNSResponder
 */
namespace LEA_MDNSResponder {

/**
 * CONTROL
 */


/**
 * MAINTENANCE
 */

/*
 * MDNSResponder::_process
 *
 * Run the MDNS process. Should be called in every 'loop'.
 *
 */
bool MDNSResponder::_process(bool p_bUserContext) {
    
    bool    bResult = true;
    
    if ((m_pUDPContext) &&          // UDPContext available AND
        (m_pUDPContext->next())) {  // has content
        //DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _update: Calling _parseMessage\n")););
        
        bResult = _parseMessage();
        if (p_bUserContext) {
            yield();
        }
        //DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _parsePacket %s\n"), (bResult ? "succeeded" : "FAILED")););
    }
    else if (p_bUserContext) {
        if (bResult) {              // Probing
            bResult = _updateProbeStatus();
        }
        if (bResult) {              // Service query cache check
            bResult = _checkServiceQueryCache();
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_restart
 */
bool MDNSResponder::_restart(void) {
    
    return ((_resetProbeStatus(true)) &&    // Stop and restart probing
            (_allocUDPContext()));          // Restart UDP
}


/**
 * RECEIVING
 */

/*
 * MDNSResponder::_parseMessage
 */
bool MDNSResponder::_parseMessage(void) {
    DEBUG_EX_INFO(
            unsigned long   ulStartTime = millis();
            unsigned        uStartMemory = ESP.getFreeHeap();
            DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _parseMessage (Time: %lu ms, heap: %u bytes, from %s(%u), to %s(%u))\n"), ulStartTime, uStartMemory,
                                    IPAddress(m_pUDPContext->getRemoteAddress()).toString().c_str(), m_pUDPContext->getRemotePort(),
                                    IPAddress(m_pUDPContext->getDestAddress()).toString().c_str(), m_pUDPContext->getLocalPort());
    );
    //DEBUG_EX_INFO(_udpDump(););
    
    bool    bResult = false;
    
    stcMDNS_MsgHeader   header;
    if (_readMDNSMsgHeader(header)) {
        if (0 == header.m_4bOpcode) {   // A standard query
            if (header.m_1bQR) {        // Received a response -> answers to a query
                //DEBUG_EX_RX(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _parseMessage: Reading answers: ID:%u, Q:%u, A:%u, NS:%u, AR:%u\n"), header.m_u16ID, header.m_u16QDCount, header.m_u16ANCount, header.m_u16NSCount, header.m_u16ARCount););
                bResult = _parseResponse(header);
            }
            else {                      // Received a query (Questions)
                //DEBUG_EX_RX(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _parseMessage: Reading query: ID:%u, Q:%u, A:%u, NS:%u, AR:%u\n"), header.m_u16ID, header.m_u16QDCount, header.m_u16ANCount, header.m_u16NSCount, header.m_u16ARCount););
                bResult = _parseQuery(header);
            }
        }
        else {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _parseMessage: Received UNEXPECTED opcode:%u. Ignoring message!\n"), header.m_4bOpcode););
            m_pUDPContext->flush();
        }
    }
    else {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _parseMessage: FAILED to read header\n")););
        m_pUDPContext->flush();
    }
    DEBUG_EX_INFO(
            unsigned    uFreeHeap = ESP.getFreeHeap();
            DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _parseMessage: Done (%s after %lu ms, ate %i bytes, remaining %u)\n\n"), (bResult ? "Succeeded" : "FAILED"), (millis() - ulStartTime), (uStartMemory - uFreeHeap), uFreeHeap);
    );
    return bResult;
}

/*
 * MDNSResponder::_parseQuery
 *
 * Queries are of interest in two cases:
 * 1. allow for tiebreaking while probing in the case of a race condition between two instances probing for
 *    the same name at the same time
 * 2. provide answers to questions for our host domain or any presented service
 *
 * When reading the questions, a set of (planned) responses is created, eg. a reverse PTR question for the host domain
 * gets an A (IP address) response, a PTR question for the _services._dns-sd domain gets a PTR (type) response for any
 * registered service, ...
 *
 * As any mDNS responder should be able to handle 'legacy' queries (from DNS clients), this case is handled here also.
 * Legacy queries have got only one (unicast) question and are directed to the local DNS port (not the multicast port).
 *
 * 1. 
 */
bool MDNSResponder::_parseQuery(const MDNSResponder::stcMDNS_MsgHeader& p_MsgHeader) {
    
    bool    bResult = true;

    stcMDNSSendParameter    sendParameter;
    uint8_t                 u8HostOrServiceReplies = 0;
    for (uint16_t qd=0; ((bResult) && (qd<p_MsgHeader.m_u16QDCount)); ++qd) {

