esp8266/Arduino/libraries/ESP8266mDNS/LEA_mDNSResponder/ESP8266mDNS Control.cpp
/*
 * MDNSResponder::_processSRVAnswer
 */
bool MDNSResponder::_processSRVAnswer(const MDNSResponder::stcMDNS_RRAnswerSRV* p_pSRVAnswer,
                                      bool& p_rbFoundNewKeyAnswer) {
    
    bool    bResult = false;
    
    if ((bResult = (0 != p_pSRVAnswer))) {
        // eg. MyESP._http._tcp.local SRV xxxx xx yy zz 5000 esp8266.local
        
        stcMDNSServiceQuery*    pServiceQuery = m_pServiceQueries;
        while (pServiceQuery) {
            stcMDNSServiceQuery::stcAnswer* pSQAnswer = pServiceQuery->findAnswerForServiceDomain(p_pSRVAnswer->m_Header.m_Domain);
            if (pSQAnswer) {    // Answer for this service domain (eg. MyESP._http._tcp.local) available
                if (p_pSRVAnswer->m_u32TTL) {   // First or update message (TTL != 0)
                    pSQAnswer->m_TTLHostDomainAndPort.set(p_pSRVAnswer->m_u32TTL, millis());    // Update TTL tag
                    DEBUG_EX_INFO(
                            DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processSRVAnswer: Updated TTL for "));
                            _printRRDomain(pSQAnswer->m_ServiceDomain);
                            DEBUG_OUTPUT.printf_P(PSTR_LEA(" host domain and port\n"));
                    );
                    // Host domain & Port
                    if ((pSQAnswer->m_HostDomain != p_pSRVAnswer->m_SRVDomain) ||
                        (pSQAnswer->m_u16Port != p_pSRVAnswer->m_u16Port)) {
                        
                        pSQAnswer->m_HostDomain = p_pSRVAnswer->m_SRVDomain;
                        pSQAnswer->releaseHostDomain();
                        pSQAnswer->m_u16Port = p_pSRVAnswer->m_u16Port;
                        pSQAnswer->m_u32ContentFlags |= ServiceQueryAnswerType_HostDomainAndPort;

                        p_rbFoundNewKeyAnswer = true;
                        if (pServiceQuery->m_fnCallback) {
                            pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_HostDomainAndPort, true, pServiceQuery->m_pUserdata);
                        }
                    }
                }
                else {                      // Goodby message
                    pSQAnswer->m_TTLHostDomainAndPort.set(1, millis());             // See RFC 6762, 10.1
                    pSQAnswer->m_TTLHostDomainAndPort.m_bUpdateScheduled = true;    // Avoid 'cache update' query
                    DEBUG_EX_INFO(
                            DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processSRVAnswer: 'Goodbye' received for "));
                            _printRRDomain(pSQAnswer->m_ServiceDomain);
                            DEBUG_OUTPUT.printf_P(PSTR_LEA(" host domain and port\n"));
                    );
                }
            }
            pServiceQuery = pServiceQuery->m_pNext;
        }   // while(service query)
    }   // else: No p_pSRVAnswer
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processSRVAnswer: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_processTXTAnswer
 */
bool MDNSResponder::_processTXTAnswer(const MDNSResponder::stcMDNS_RRAnswerTXT* p_pTXTAnswer) {
    
    bool    bResult = false;
    
    if ((bResult = (0 != p_pTXTAnswer))) {
        // eg. MyESP._http._tcp.local TXT xxxx xx c#=1
        
        stcMDNSServiceQuery*    pServiceQuery = m_pServiceQueries;
        while (pServiceQuery) {
            stcMDNSServiceQuery::stcAnswer* pSQAnswer = pServiceQuery->findAnswerForServiceDomain(p_pTXTAnswer->m_Header.m_Domain);
            if (pSQAnswer) {    // Answer for this service domain (eg. MyESP._http._tcp.local) available
                if (p_pTXTAnswer->m_u32TTL) {   // First or update message
                    pSQAnswer->m_TTLTxts.set(p_pTXTAnswer->m_u32TTL, millis()); // Update TTL tag
                    DEBUG_EX_INFO(
                            DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processTXTAnswer: Updated TTL for "));
                            _printRRDomain(pSQAnswer->m_ServiceDomain);
                            DEBUG_OUTPUT.printf_P(PSTR_LEA(" TXTs\n"));
                    );
                    if (!pSQAnswer->m_Txts.compare(p_pTXTAnswer->m_Txts)) {
                        pSQAnswer->m_Txts = p_pTXTAnswer->m_Txts;
                        pSQAnswer->m_u32ContentFlags |= ServiceQueryAnswerType_Txts;
                        pSQAnswer->releaseTxts();
                        
                        if (pServiceQuery->m_fnCallback) {
                            pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_Txts, true, pServiceQuery->m_pUserdata);
                        }
                    }
                }
                else {                      // Goodby message
                    pSQAnswer->m_TTLTxts.set(1, millis());          // See RFC 6762, 10.1
                    pSQAnswer->m_TTLTxts.m_bUpdateScheduled = true; // Avoid 'cache update' query
                    DEBUG_EX_INFO(
                            DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processTXTAnswer: 'Goodbye' received for "));
                            _printRRDomain(pSQAnswer->m_ServiceDomain);
                            DEBUG_OUTPUT.printf_P(PSTR_LEA(" TXTs\n"));
                    );
                }
            }
            pServiceQuery = pServiceQuery->m_pNext;
        }   // while(service query)
    }   // else: No p_pTXTAnswer
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processTXTAnswer: FAILED!\n")); });
    return bResult;
}

#ifdef MDNS_IP4_SUPPORT
    /*
     * MDNSResponder::_processAAnswer
     */
    bool MDNSResponder::_processAAnswer(const MDNSResponder::stcMDNS_RRAnswerA* p_pAAnswer) {
        
        bool    bResult = false;
        
        if ((bResult = (0 != p_pAAnswer))) {
            // eg. esp8266.local A xxxx xx 192.168.2.120
            
            stcMDNSServiceQuery*    pServiceQuery = m_pServiceQueries;
            while (pServiceQuery) {
                stcMDNSServiceQuery::stcAnswer* pSQAnswer = pServiceQuery->findAnswerForHostDomain(p_pAAnswer->m_Header.m_Domain);
                if (pSQAnswer) {    // Answer for this host domain (eg. esp8266.local) available
                	stcMDNSServiceQuery::stcAnswer::stcIP4Address*  pIP4Address = pSQAnswer->findIP4Address(p_pAAnswer->m_IPAddress);
                    if (pIP4Address) {
                        // Already known IP4 address
                        if (p_pAAnswer->m_u32TTL) { // Valid TTL -> Update answers TTL
                            pIP4Address->m_TTL.set(p_pAAnswer->m_u32TTL, millis());
                            DEBUG_EX_INFO(
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processAAnswer: Updated TTL for "));
                                    _printRRDomain(pSQAnswer->m_ServiceDomain);
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA(" IP4Address (%s)\n"), pIP4Address->m_IPAddress.toString().c_str());
                            );
                        }
                        else {                      // 'Goodbye' message for known IP4 address
                            pIP4Address->m_TTL.set(1, millis());            // See RFC 6762, 10.1
                            pIP4Address->m_TTL.m_bUpdateScheduled = true;   // Avoid 'cache update' query
                            DEBUG_EX_INFO(
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processAAnswer: 'Goodbye' received for "));
                                    _printRRDomain(pSQAnswer->m_ServiceDomain);
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA(" IP4 address (%s)\n"), pIP4Address->m_IPAddress.toString().c_str());
                            );
                        }                                
                    }
                    else {
                        // Until now unknown IP4 address -> Add (if the message isn't just a 'Goodbye' note)
                        if (p_pAAnswer->m_u32TTL) { // NOT just a 'Goodbye' message
                            pIP4Address = new stcMDNSServiceQuery::stcAnswer::stcIP4Address(p_pAAnswer->m_IPAddress, p_pAAnswer->m_u32TTL, millis());
                            if ((pIP4Address) &&
                                (pSQAnswer->addIP4Address(pIP4Address))) {
                                
                                pSQAnswer->m_u32ContentFlags |= ServiceQueryAnswerType_IP4Address;

