esp8266/Arduino/libraries/ESP8266mDNS/LEA_mDNSResponder/ESP8266mDNS Control.cpp
                                if (pServiceQuery->m_fnCallback) {
                                    pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_IP4Address, true, pServiceQuery->m_pUserdata);
                                }
                            }
                            else {   
                                DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processAAnswer: FAILED to add IP4 address (%s)!\n"), p_pAAnswer->m_IPAddress.toString().c_str()););
                            }
                        }
                    }
                }
                pServiceQuery = pServiceQuery->m_pNext;
            }   // while(service query)         
        }   // else: No p_pAAnswer
        DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processAAnswer: FAILED!\n")); });
        return bResult;
    }
#endif

#ifdef MDNS_IP6_SUPPORT
    /*
     * MDNSResponder::_processAAAAAnswer
     */
    bool MDNSResponder::_processAAAAAnswer(const MDNSResponder::stcMDNS_RRAnswerAAAA* p_pAAAAAnswer) {
        
        bool    bResult = false;
        
        if ((bResult = (0 != p_pAAAAAnswer))) {
            // eg. esp8266.local AAAA xxxx xx 0bf3::0c
            
            stcMDNSServiceQuery*    pServiceQuery = m_pServiceQueries;
            while (pServiceQuery) {
                stcMDNSServiceQuery::stcAnswer* pSQAnswer = pServiceQuery->findAnswerForHostDomain(p_pAAAAAnswer->m_Header.m_Domain);
                if (pSQAnswer) {    // Answer for this host domain (eg. esp8266.local) available
                    stcIP6Address*  pIP6Address = pSQAnswer->findIP6Address(p_pAAAAAnswer->m_IPAddress);
                    if (pIP6Address) {
                        // Already known IP6 address
                        if (p_pAAAAAnswer->m_u32TTL) { // Valid TTL -> Update answers TTL
                            pIP6Address->m_TTL.set(p_pAAAAAnswer->m_u32TTL, millis());
                            DEBUG_EX_INFO(
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processAAnswer: Updated TTL for "));
                                    _printRRDomain(pSQAnswer->m_ServiceDomain);
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA(" IP6 address (%s)\n"), pIP6Address->m_IPAddress.toString().c_str());
                            );
                        }
                        else {                      // 'Goodbye' message for known IP6 address
                            pIP6Address->m_TTL.set(1, millis());            // See RFC 6762, 10.1
                            pIP6Address->m_TTL.m_bUpdateScheduled = true;   // Avoid 'cache update' query
                            DEBUG_EX_INFO(
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processAAnswer: 'Goodbye' received for "));
                                    _printRRDomain(pSQAnswer->m_ServiceDomain);
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA(" IP6 address (%s)\n"), pIP6Address->m_IPAddress.toString().c_str());
                            );
                        }                                
                    }
                    else {
                        // Until now unknown IP6 address -> Add (if the message isn't just a 'Goodbye' note)
                        if (p_pAAAAAnswer->m_u32TTL) { // NOT just a 'Goodbye' message
                            pIP6Address = new stcIP6Address(p_pAAAAAnswer->m_IPAddress, p_pAAAAAnswer->m_u32TTL, millis());
                            if ((pIP6Address) &&
                                (pSQAnswer->addIP6Address(pIP6Address))) {
                                
                                pSQAnswer->m_u32ContentFlags |= ServiceQueryAnswerType_IP6Address;

                                if (pServiceQuery->m_fnCallback) {
                                    pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_IP6Address, true, pServiceQuery->m_pUserdata);
                                }
                            }
                            else {   
                                DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _processAAnswer: FAILED to add IP6 address (%s)!\n"), p_pAAAAAnswer->m_IPAddress.toString().c_str()););
                            }
                        }
                    }
                }
                pServiceQuery = pServiceQuery->m_pNext;
            }   // while(service query)
        }   // else: No p_pAAAAAnswer
        
        return bResult;
    }
#endif


/*
 * PROBING
 */

/*
 * MDNSResponder::_updateProbeStatus
 *
 * Manages the (outgoing) probing process.
 * - If probing has not been started yet (ProbingStatus_NotStarted), the initial delay (see RFC 6762) is determined and
 *   the process is started
 * - After timeout (of initial or subsequential delay) a probe message is send out for three times. If the message has
 *   already been sent out three times, the probing has been successful and is finished.
 *
 * Conflict management is handled in '_parseResponse ff.'
 * Tiebraking is handled in 'parseQuery ff.'
 */
bool MDNSResponder::_updateProbeStatus(void) {

    bool    bResult = true;
    
    //
    // Probe host domain
    if ((ProbingStatus_ReadyToStart == m_HostProbeInformation.m_ProbingStatus) &&                   // Ready to get started AND
        (_getResponseMulticastInterface(SOFTAP_MODE | STATION_MODE) != IPAddress())) {              // Has IP address
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _updateProbeStatus: Starting host probing...\n")););

        // First probe delay SHOULD be random 0-250 ms
        m_HostProbeInformation.m_ulNextProbeTimeout = (millis() + (rand() % MDNS_PROBE_DELAY));
        m_HostProbeInformation.m_ProbingStatus = ProbingStatus_InProgress;
    }
    else if ((ProbingStatus_InProgress == m_HostProbeInformation.m_ProbingStatus) &&                // Probing AND
             (m_HostProbeInformation.m_ulNextProbeTimeout < millis())) {                            // Time for next probe

        if (MDNS_PROBE_COUNT > m_HostProbeInformation.m_u8ProbesSent) {                             // Send next probe
            if ((bResult = _sendHostProbe())) {
                DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _updateProbeStatus: Did sent host probe\n")););
                m_HostProbeInformation.m_ulNextProbeTimeout = (millis() + MDNS_PROBE_DELAY);
                ++m_HostProbeInformation.m_u8ProbesSent;
            }
        }
        else {                                                                                      // Probing finished
            DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _updateProbeStatus: Done host probing.\n")););
            m_HostProbeInformation.m_ProbingStatus = ProbingStatus_Done;
            if (m_HostProbeInformation.m_fnProbeResultCallback) {
                m_HostProbeInformation.m_fnProbeResultCallback(this, m_pcHostname, 0, true, m_HostProbeInformation.m_pProbeResultCallbackUserdata);
            }

            _announce();
        }
    }   // else: Probing already finished OR waiting for next time slot

    //
    // Probe services
    for (stcMDNSService* pService=m_pServices; ((bResult) && (pService)); pService=pService->m_pNext) {
        if (ProbingStatus_ReadyToStart == pService->m_ProbeInformation.m_ProbingStatus) {       // Ready to get started

