esp8266/Arduino/libraries/ESP8266mDNS/LEA_mDNSResponder/ESP8266mDNS Control.cpp
            pService->m_ProbeInformation.m_ulNextProbeTimeout = (millis() + MDNS_PROBE_DELAY);  // More or equal than first probe for host domain
            pService->m_ProbeInformation.m_ProbingStatus = ProbingStatus_InProgress;
        }
        else if ((ProbingStatus_InProgress == pService->m_ProbeInformation.m_ProbingStatus) &&  // Probing AND
                 (pService->m_ProbeInformation.m_ulNextProbeTimeout < millis())) {              // Time for next probe

            if (MDNS_PROBE_COUNT > pService->m_ProbeInformation.m_u8ProbesSent) {                           // Send next probe
                if ((bResult = _sendServiceProbe(*pService))) {
                    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _updateProbeStatus: Did sent service probe (%u)\n"), (pService->m_ProbeInformation.m_u8ProbesSent + 1)););
                    pService->m_ProbeInformation.m_ulNextProbeTimeout = (millis() + MDNS_PROBE_DELAY);
                    ++pService->m_ProbeInformation.m_u8ProbesSent;
                }
            }
            else {                                                                                      // Probing finished
                DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _updateProbeStatus: Done service probing %s.%s.%s\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol););
                pService->m_ProbeInformation.m_ProbingStatus = ProbingStatus_Done;

                MDNSProbeResultCallbackFn   fnProbeResultCallback = 0;
                void*                       pProbeResultCallbackUserdata = 0;
                if (pService->m_ProbeInformation.m_fnProbeResultCallback) {
                    fnProbeResultCallback = pService->m_ProbeInformation.m_fnProbeResultCallback;
                    pProbeResultCallbackUserdata = pService->m_ProbeInformation.m_pProbeResultCallbackUserdata;
                }
                else {
                    fnProbeResultCallback = m_HostProbeInformation.m_fnProbeResultCallback;
                    pProbeResultCallbackUserdata = m_HostProbeInformation.m_pProbeResultCallbackUserdata;
                }
                if (fnProbeResultCallback) {
                    fnProbeResultCallback(this, (pService->m_pcName ?: m_pcHostname), pService, true, pProbeResultCallbackUserdata);
                }

                //_announceService(*pService);
            }
        }   // else: Probing already finished OR waiting for next time slot
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _updateProbeStatus: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_resetProbeStatus
 *
 * Resets the probe status.
 * If 'p_bRestart' is set, the status is set to ProbingStatus_NotStarted. Consequently,
 * when running 'updateProbeStatus' (which is done in every '_update' loop), the probing
 * process is restarted.
 */
bool MDNSResponder::_resetProbeStatus(bool p_bRestart /*= true*/) {
    
    m_HostProbeInformation.clear(false);
    m_HostProbeInformation.m_ProbingStatus = (p_bRestart ? ProbingStatus_ReadyToStart : ProbingStatus_Done);
    
    for (stcMDNSService* pService=m_pServices; pService; pService=pService->m_pNext) {
        pService->m_ProbeInformation.clear(false);
        pService->m_ProbeInformation.m_ProbingStatus = (p_bRestart ? ProbingStatus_ReadyToStart : ProbingStatus_Done);
    }
    return true;
}

/*
 * MDNSResponder::_hasProbesWaitingForAnswers
 */
bool MDNSResponder::_hasProbesWaitingForAnswers(void) const {

    bool    bResult = ((ProbingStatus_InProgress == m_HostProbeInformation.m_ProbingStatus) &&      // Probing
                       (0 < m_HostProbeInformation.m_u8ProbesSent));                                // And really probing

    for (stcMDNSService* pService=m_pServices; ((!bResult) && (pService)); pService=pService->m_pNext) {
        bResult = ((ProbingStatus_InProgress == pService->m_ProbeInformation.m_ProbingStatus) &&    // Probing
                   (0 < pService->m_ProbeInformation.m_u8ProbesSent));                              // And really probing
    }
    return bResult;
}

/*
 * MDNSResponder::_sendHostProbe
 *
 * Asks (probes) in the local network for the planned host domain
 * - (eg. esp8266.local)
 *
 * To allow 'tiebreaking' (see '_parseQuery'), the answers for these questions are delivered in
 * the 'knwon answers' section of the query.
 * Host domain:
 * - A/AAAA (eg. esp8266.esp -> 192.168.2.120)
 */
bool MDNSResponder::_sendHostProbe(void) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _sendHostProbe (%s, %lu)\n"), m_pcHostname, millis()););
    
    bool    bResult = true;
        
    // Requests for host domain
    stcMDNSSendParameter    sendParameter;
    sendParameter.m_bCacheFlush = false;    // RFC 6762 10.2
    
    sendParameter.m_pQuestions = new stcMDNS_RRQuestion;
    if (((bResult = (0 != sendParameter.m_pQuestions))) &&
        ((bResult = _buildDomainForHost(m_pcHostname, sendParameter.m_pQuestions->m_Header.m_Domain)))) {

        sendParameter.m_pQuestions->m_bUnicast = true;
        sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Type = DNS_RRTYPE_ANY;
        sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Class = (0x8000 | DNS_RRCLASS_IN);   // Unicast & INternet
    
        // Add known answers
#ifdef MDNS_IP4_SUPPORT
        sendParameter.m_u8HostReplyMask |= ContentFlag_A;                                   // Add A answer
#endif  
#ifdef MDNS_IP6_SUPPORT
        sendParameter.m_u8HostReplyMask |= ContentFlag_AAAA;                                // Add AAAA answer
#endif
    }
    else {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _sendHostProbe: FAILED to create host question!\n")););
        if (sendParameter.m_pQuestions) {
            delete sendParameter.m_pQuestions;
            sendParameter.m_pQuestions = 0;
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _sendHostProbe: FAILED!\n")); });
    return ((bResult) &&
            (_sendMDNSMessage(sendParameter)));
}

