esp8266/Arduino/libraries/ESP8266mDNS/LEA_mDNSResponder/ESP8266mDNS Control.cpp
/*
 * MDNSResponder::_sendServiceProbe
 *
 * Asks (probes) in the local network for the planned service instance domain
 * - (eg. MyESP._http._tcp.local).
 *
 * To allow 'tiebreaking' (see '_parseQuery'), the answers for these questions are delivered in
 * the 'knwon answers' section of the query.
 * Service domain:
 * - SRV (eg. MyESP._http._tcp.local -> 5000 esp8266.local)
 * - PTR NAME (eg. _http._tcp.local -> MyESP._http._tcp.local) (TODO: Check if needed, maybe TXT is better)
 */
bool MDNSResponder::_sendServiceProbe(stcMDNSService& p_rService) {
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _sendServiceProbe (%s.%s.%s, %lu)\n"), (p_rService.m_pcName ?: m_pcHostname), p_rService.m_pcService, p_rService.m_pcProtocol, millis()););

    bool    bResult = true;

    // Requests for service instance domain
    stcMDNSSendParameter    sendParameter;
    sendParameter.m_bCacheFlush = false;    // RFC 6762 10.2

    sendParameter.m_pQuestions = new stcMDNS_RRQuestion;
    if (((bResult = (0 != sendParameter.m_pQuestions))) &&
        ((bResult = _buildDomainForService(p_rService, true, sendParameter.m_pQuestions->m_Header.m_Domain)))) {

        sendParameter.m_pQuestions->m_bUnicast = true;
        sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Type = DNS_RRTYPE_ANY;
        sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Class = (0x8000 | DNS_RRCLASS_IN);   // Unicast & INternet

        // Add known answers
        p_rService.m_u8ReplyMask = (ContentFlag_SRV | ContentFlag_PTR_NAME);                // Add SRV and PTR NAME answers
    }
    else {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _sendServiceProbe: FAILED to create service question!\n")););
        if (sendParameter.m_pQuestions) {
            delete sendParameter.m_pQuestions;
            sendParameter.m_pQuestions = 0;
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _sendServiceProbe: FAILED!\n")); });
    return ((bResult) &&
            (_sendMDNSMessage(sendParameter)));
}

/*
 * MDNSResponder::_cancelProbingForHost
 */
bool MDNSResponder::_cancelProbingForHost(void) {

    bool    bResult = false;

    m_HostProbeInformation.clear(false);

    // Send host notification
    if (m_HostProbeInformation.m_fnProbeResultCallback) {
        m_HostProbeInformation.m_fnProbeResultCallback(this, m_pcHostname, 0, false, m_HostProbeInformation.m_pProbeResultCallbackUserdata);

        bResult = true;
    }

    for (stcMDNSService* pService=m_pServices; ((!bResult) && (pService)); pService=pService->m_pNext) {
        bResult = _cancelProbingForService(*pService);
    }
    return bResult;
}

/*
 * MDNSResponder::_cancelProbingForService
 */
bool MDNSResponder::_cancelProbingForService(stcMDNSService& p_rService) {

    bool    bResult = false;

    p_rService.m_ProbeInformation.clear(false);

    // Send notification
    MDNSProbeResultCallbackFn   fnProbeResultCallback = 0;
    void*                       pProbeResultCallbackUserdata = 0;
    if (p_rService.m_ProbeInformation.m_fnProbeResultCallback) {
        fnProbeResultCallback = p_rService.m_ProbeInformation.m_fnProbeResultCallback;
        pProbeResultCallbackUserdata = p_rService.m_ProbeInformation.m_pProbeResultCallbackUserdata;
    }
    else {
        fnProbeResultCallback = m_HostProbeInformation.m_fnProbeResultCallback;
        pProbeResultCallbackUserdata = m_HostProbeInformation.m_pProbeResultCallbackUserdata;
    }
    if (fnProbeResultCallback) {
        fnProbeResultCallback(this, (p_rService.m_pcName ?: m_pcHostname), &p_rService, false, pProbeResultCallbackUserdata);
        bResult = true;
    }
    return bResult;
}



/**
 * ANNOUNCING
 */

/*
 * MDNSResponder::_announce
 *
 * Announces the host domain:
 * - A/AAAA (eg. esp8266.local -> 192.168.2.120)
 * - PTR (eg. 192.168.2.120.in-addr.arpa -> esp8266.local)
 *
 * and all presented services:
 * - PTR_TYPE (_services._dns-sd._udp.local -> _http._tcp.local)
 * - PTR_NAME (eg. _http._tcp.local -> MyESP8266._http._tcp.local)
 * - SRV (eg. MyESP8266._http._tcp.local -> 5000 esp8266.local)
 * - TXT (eg. MyESP8266._http._tcp.local -> c#=1)
 *
 * Goodbye (Un-Announcing) for the host domain and all services is also handled here.
 * Goodbye messages are created by setting the TTL for the answer to 0, this happens
 * inside the '_writeXXXAnswer' procs via 'sendParameter.m_bUnannounce = true'
 */
bool MDNSResponder::_announce(bool p_bAnnounce /*= true*/) {
    
    bool    bResult = false;

    stcMDNSSendParameter    sendParameter;
    if (ProbingStatus_Done == m_HostProbeInformation.m_ProbingStatus) {

        bResult = true;

        sendParameter.m_bResponse = true;           // Announces are 'Unsolicited authorative responses'
        sendParameter.m_bAuthorative = true;
        sendParameter.m_bUnannounce = !p_bAnnounce; // When unannouncing, the TTL is set to '0' while creating the answers

        // Announce host
        sendParameter.m_u8HostReplyMask = 0;
    #ifdef MDNS_IP4_SUPPORT
        sendParameter.m_u8HostReplyMask |= ContentFlag_A;                   // A answer
        sendParameter.m_u8HostReplyMask |= ContentFlag_PTR_IP4;             // PTR_IP4 answer
    #endif
    #ifdef MDNS_IP6_SUPPORT
        sendParameter.m_u8HostReplyMask |= ContentFlag_AAAA;                // AAAA answer
        sendParameter.m_u8HostReplyMask |= ContentFlag_PTR_IP6;             // PTR_IP6 answer
    #endif

        DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _announce: Announcing host %s (%u)\n"), m_pcHostname, sendParameter.m_u8HostReplyMask););
        //bResult = _sendMDNSMessage(sendParameter);
        //DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _announceService: FAILED (A)!\n")); });

        // Announce services (service type, name, SRV (location) and TXTs)
        for (stcMDNSService* pService=m_pServices; ((bResult) && (pService)); pService=pService->m_pNext) {
            //bResult = _announceService(*pService, p_bAnnounce);
            //DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _announceService: FAILED (B)!\n")); });


            if (ProbingStatus_Done == pService->m_ProbeInformation.m_ProbingStatus) {
                pService->m_u8ReplyMask = (ContentFlag_PTR_TYPE | ContentFlag_PTR_NAME | ContentFlag_SRV | ContentFlag_TXT);

