esp8266/Arduino/libraries/ESP8266mDNS/LEA_mDNSResponder/ESP8266mDNS Control.cpp
                    if (pServiceQuery->m_fnCallback) {
                        pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), u32ContentFlags, false, pServiceQuery->m_pUserdata);
                    }
                }
                
                // Txts (from TXT)
                if ((bResult) &&
                    (pSQAnswer->m_TTLTxts.has80Percent(u32Now))) {
                    
                    bResult = ((_sendMDNSQuery(pSQAnswer->m_ServiceDomain, DNS_RRTYPE_TXT)) &&
                               ((pSQAnswer->m_TTLTxts.m_bUpdateScheduled = true)));
                    DEBUG_EX_INFO(
                            DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _checkServiceQueryCache: Update scheduled for "));
                            _printRRDomain(pSQAnswer->m_ServiceDomain);
                            DEBUG_OUTPUT.printf_P(PSTR_LEA(" TXTs %s\n"), (bResult ? "OK" : "FAILURE"));
                    );
                }
                else if ((bResult) &&
                         (pSQAnswer->m_TTLTxts.isOutdated(u32Now))) {
                    
                    // Delete
                    pSQAnswer->m_Txts.clear();
                    pSQAnswer->m_TTLTxts.set(0, 0);
                    
                    // Remove content flags for deleted answer parts
                    pSQAnswer->m_u32ContentFlags &= ~ServiceQueryAnswerType_Txts;

                    if (pServiceQuery->m_fnCallback) {
                        pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_Txts, false, pServiceQuery->m_pUserdata);
                    }
                }
                
                // 3. level answers
#ifdef MDNS_IP4_SUPPORT
                // IP4Address (from A)
                stcMDNSServiceQuery::stcAnswer::stcIP4Address*  pIP4Address = pSQAnswer->m_pIP4Addresses;
                bool                                            bAUpdateQuerySent = false;
                while ((pIP4Address) &&
                       (bResult)) {
                           
                	stcMDNSServiceQuery::stcAnswer::stcIP4Address*  pNextIP4Address = pIP4Address->m_pNext; // Get 'next' early, as 'current' may be deleted at the end...
                    
                    if (pIP4Address->m_TTL.has80Percent(u32Now)) {      // Needs update
                        if ((bAUpdateQuerySent) ||
                            ((bResult = _sendMDNSQuery(pSQAnswer->m_HostDomain, DNS_RRTYPE_A)))) {
                            
                            pIP4Address->m_TTL.m_bUpdateScheduled = true;
                            bAUpdateQuerySent = true;
                            
                            DEBUG_EX_INFO(
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _checkServiceQueryCache: Update scheduled for "));
                                    _printRRDomain(pSQAnswer->m_ServiceDomain);
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA(" IP4 address (%s)\n"), (pIP4Address->m_IPAddress.toString().c_str()));
                            );
                        }
                    }
                    else if (pIP4Address->m_TTL.isOutdated(u32Now)) {   // Outdated: can be deleted
                        pSQAnswer->removeIP4Address(pIP4Address);
                        if (!pSQAnswer->m_pIP4Addresses) {  // NO IP4 address left -> remove content flag
                            pSQAnswer->m_u32ContentFlags &= ~ServiceQueryAnswerType_IP4Address;
                        }
                        // Notify client
                        if (pServiceQuery->m_fnCallback) {
                            pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_IP4Address, false, pServiceQuery->m_pUserdata);
                        }
                    }
                    
                    pIP4Address = pNextIP4Address;  // Next
                }   // while
#endif
#ifdef MDNS_IP6_SUPPORT
                // IP6Address (from AAAA)
                stcMDNSServiceQuery::stcAnswer::stcIP6Address*  pIP6Address = pSQAnswer->m_pIP6Addresses;
                bool                                            bAAAAUpdateQuerySent = false;
                while ((pIP6Address) &&
                       (bResult)) {
                           
                	stcMDNSServiceQuery::stcAnswer::stcIP6Address*  pNextIP6Address = pIP6Address->m_pNext; // Get 'next' early, as 'current' may be deleted at the end...
                    
                    if (pIP6Address->m_TTL.has80Percent(u32Now)) {      // Needs update
                        if ((bAAAAUpdateQuerySent) ||
                            ((bResult = _sendMDNSQuery(pSQAnswer->m_HostDomain, DNS_RRTYPE_AAAA)))) {
                            
                            pIP6Address->m_TTL.m_bUpdateScheduled = true;
                            bAAAAUpdateQuerySent = true;
                            
                            DEBUG_EX_INFO(
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _checkServiceQueryCache: Update scheduled for "));
                                    _printRRDomain(pSQAnswer->m_ServiceDomain);
                                    DEBUG_OUTPUT.printf_P(PSTR_LEA(" IP6 address (%s)\n"), (pIP6Address->m_IPAddress.toString().c_str()));
                            );
                        }
                    }
                    else if (pIP6Address->m_TTL.isOutdated(u32Now)) {   // Outdated: can be deleted
                        pSQAnswer->removeIP6Address(pIP6Address);
                        if (!pSQAnswer->m_pIP6Addresses) {  // NO IP6 address left -> remove content flag
                            pSQAnswer->m_u32ContentFlags &= ~ServiceQueryAnswerType_IP6Address;
                        }
                        // Notify client
                        if (pServiceQuery->m_fnCallback) {
                            pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_IP6Address, false, pServiceQuery->m_pUserdata);
                        }
                    }
                    
                    pIP6Address = pNextIP6Address;  // Next
                }   // while
#endif
                pSQAnswer = pNextSQAnswer;
            }
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _checkServiceQueryCache: FAILED!\n")); });
    return bResult;
}


