esp8266/Arduino/libraries/ESP8266mDNS/LEA_mDNSResponder/ESP8266mDNS Control.cpp
/*
 * MDNSResponder::_replyMaskForHost
 *
 * Determines the relavant host answers for the given question.
 * - A question for the hostname (eg. esp8266.local) will result in an A/AAAA (eg. 192.168.2.129) reply.
 * - A question for the reverse IP address (eg. 192-168.2.120.inarpa.arpa) will result in an PTR_IP4 (eg. esp8266.local) reply.
 *
 * In addition, a full name match (question domain == host domain) is marked.
 */
uint8_t MDNSResponder::_replyMaskForHost(const MDNSResponder::stcMDNS_RRHeader& p_RRHeader,
                                         bool* p_pbFullNameMatch /*= 0*/) const {
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _replyMaskForHost\n")););
    
    uint8_t u8ReplyMask = 0;
    (p_pbFullNameMatch ? *p_pbFullNameMatch = false : 0);
    
    if ((DNS_RRCLASS_IN == p_RRHeader.m_Attributes.m_u16Class) ||
        (DNS_RRCLASS_ANY == p_RRHeader.m_Attributes.m_u16Class)) {
        
        if ((DNS_RRTYPE_PTR == p_RRHeader.m_Attributes.m_u16Type) ||
            (DNS_RRTYPE_ANY == p_RRHeader.m_Attributes.m_u16Type)) {
            // PTR request
#ifdef MDNS_IP4_SUPPORT
            stcMDNS_RRDomain    reverseIP4Domain;
            if ((_buildDomainForReverseIP4(_getResponseMulticastInterface(SOFTAP_MODE | STATION_MODE), reverseIP4Domain)) &&
                (p_RRHeader.m_Domain == reverseIP4Domain)) {
                // Reverse domain match
                u8ReplyMask |= ContentFlag_PTR_IP4;
            }
#endif
#ifdef MDNS_IP6_SUPPORT
            // TODO
#endif
        }   // Address qeuest
        
        stcMDNS_RRDomain    hostDomain;
        if ((_buildDomainForHost(m_pcHostname, hostDomain)) &&
            (p_RRHeader.m_Domain == hostDomain)) {  // Host domain match

            (p_pbFullNameMatch ? (*p_pbFullNameMatch = true) : (0));

#ifdef MDNS_IP4_SUPPORT
            if ((DNS_RRTYPE_A == p_RRHeader.m_Attributes.m_u16Type) ||
                (DNS_RRTYPE_ANY == p_RRHeader.m_Attributes.m_u16Type)) {
                // IP4 address request
                u8ReplyMask |= ContentFlag_A;
            }
#endif
#ifdef MDNS_IP6_SUPPORT
            if ((DNS_RRTYPE_AAAA == p_RRHeader.m_Attributes.m_u16Type) ||
                (DNS_RRTYPE_ANY == p_RRHeader.m_Attributes.m_u16Type)) {
                // IP6 address request
                u8ReplyMask |= ContentFlag_AAAA;
            }
#endif
        }
    }
    else {
        //DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _replyMaskForHost: INVALID RR-class (0x%04X)!\n"), p_RRHeader.m_Attributes.m_u16Class););
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _replyMaskForHost: %u\n"), u8ReplyMask););
    return u8ReplyMask;
}

/*
 * MDNSResponder::_replyMaskForService
 *
 * Determines the relevant service answers for the given question
 * - A PTR dns-sd service enum question (_services.dns-sd._udp.local) will result into an PTR_TYPE (eg. _http._tcp.local) answer
 * - A PTR service type question (eg. _http._tcp.local) will result into an PTR_NAME (eg. MyESP._http._tcp.local) answer
 * - A PTR service name question (eg. MyESP._http._tcp.local) will result into an PTR_NAME (eg. MyESP._http._tcp.local) answer
 * - A SRV service name question (eg. MyESP._http._tcp.local) will result into an SRV (eg. 5000 MyESP.local) answer
 * - A TXT service name question (eg. MyESP._http._tcp.local) will result into an TXT (eg. c#=1) answer
 *
 * In addition, a full name match (question domain == service instance domain) is marked.
 */
uint8_t MDNSResponder::_replyMaskForService(const MDNSResponder::stcMDNS_RRHeader& p_RRHeader,
                                            const MDNSResponder::stcMDNSService& p_Service,
                                            bool* p_pbFullNameMatch /*= 0*/) const {
    
    uint8_t u8ReplyMask = 0;
    (p_pbFullNameMatch ? *p_pbFullNameMatch = false : 0);
    
    if ((DNS_RRCLASS_IN == p_RRHeader.m_Attributes.m_u16Class) ||
        (DNS_RRCLASS_ANY == p_RRHeader.m_Attributes.m_u16Class)) {
        
        stcMDNS_RRDomain    DNSSDDomain;
        if ((_buildDomainForDNSSD(DNSSDDomain)) &&                          // _services._dns-sd._udp.local
            (p_RRHeader.m_Domain == DNSSDDomain) &&
            ((DNS_RRTYPE_PTR == p_RRHeader.m_Attributes.m_u16Type) ||
             (DNS_RRTYPE_ANY == p_RRHeader.m_Attributes.m_u16Type))) {
            // Common service info requested
            u8ReplyMask |= ContentFlag_PTR_TYPE;
        }
        
        stcMDNS_RRDomain    serviceDomain;
        if ((_buildDomainForService(p_Service, false, serviceDomain)) &&    // eg. _http._tcp.local
            (p_RRHeader.m_Domain == serviceDomain) &&
            ((DNS_RRTYPE_PTR == p_RRHeader.m_Attributes.m_u16Type) ||
             (DNS_RRTYPE_ANY == p_RRHeader.m_Attributes.m_u16Type))) {
            // Special service info requested
            u8ReplyMask |= ContentFlag_PTR_NAME;
        }
        
        if ((_buildDomainForService(p_Service, true, serviceDomain)) &&     // eg. MyESP._http._tcp.local
            (p_RRHeader.m_Domain == serviceDomain)) {

            (p_pbFullNameMatch ? (*p_pbFullNameMatch = true) : (0));

            if ((DNS_RRTYPE_SRV == p_RRHeader.m_Attributes.m_u16Type) ||
                (DNS_RRTYPE_ANY == p_RRHeader.m_Attributes.m_u16Type)) {
                // Instance info SRV requested
                u8ReplyMask |= ContentFlag_SRV;
            }
            if ((DNS_RRTYPE_TXT == p_RRHeader.m_Attributes.m_u16Type) ||
                (DNS_RRTYPE_ANY == p_RRHeader.m_Attributes.m_u16Type)) {
                // Instance info TXT requested
                u8ReplyMask |= ContentFlag_TXT;
            }
        }
    }
    else {
        //DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _replyMaskForService: INVALID RR-class (0x%04X)!\n"), p_RRHeader.m_Attributes.m_u16Class););
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR_LEA("[MDNSResponder] _replyMaskForService(%s.%s.%s): %u\n"), p_Service.m_pcName, p_Service.m_pcService, p_Service.m_pcProtocol, u8ReplyMask););
    return u8ReplyMask;
}

}   // namespace LEA_MDNSResponder



